app/views/pages/profile.html.erb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "Saloum"]]
SELECT "posts".* FROM "posts" WHERE (user_id =3)  ORDER BY "posts"."created_at" DESC
---
                        <div class="post-title">
                            <a class="" accesskey="" data-gt="" href="/user/<%= User.find(@p.user_id).username %>" title="" data-testid="" >
                                <span class="post-owner-profile"><%= User.find(@p.user_id).username %></span>