app/controllers/pages_controller.rb

SELECT "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC
---
  def profile
    #grab the username for the URL as :id
    if(User.find_by_username(params[:id]))
      @username = params[:id]
    else
      #redirect to 484 (root for now)
      redirect_to root_path, :notice=> "Oops: User doesn't exist"
    end
    @posts = Post.all