app/controllers/pages_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "mike"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
SELECT "posts".* FROM "posts" WHERE (user_id =3)  ORDER BY "posts"."created_at" DESC
---
  def profile
    #grab the username for the URL as :id
    if(User.find_by_username(params[:id]))
      @username = params[:id]
    else
      #redirect to 484 (root for now)
      redirect_to root_path, :notice=> "Oops: User doesn't exist"
    end

    @posts = Post.all.where("user_id =?", User.find_by_username(params[:id]).id)