app/controllers/posts_controller.rb

    def create
        @post = current_user.posts.build(post_params)
        @post.user_id = current_user.id
        respond_to do |format|
            if (@post.save)
---
INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Hello, World"], ["user_id", 4], ["created_at", "2016-10-21 05:43:24.374840"], ["updated_at", "2016-10-21 05:43:24.374840"]]